# Pandas Learning with Comment

In this Notebook we trying to learn pandas library based on my article in Comment website.
##### Autor: Reza Tanakizadeh
##### website: https://mr-comment.ir/pandas-learning/

## Install and Loading

In [5]:
# !pip install pandas
import pandas as pd

## Define Series and DataFrame

In [6]:
S = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
S

a    3
b   -5
c    7
d    4
dtype: int64

In [23]:
df = pd.DataFrame({
                     'Country': ['Iran', 'England','France'],
                     'Capital': ['Tehran', 'London', 'Paris']
                    })
df

   Country Capital
0     Iran  Tehran
1  England  London
2   France   Paris

## Dropping

In [16]:
col_dropped = df.drop('Country', axis=1)
row_dropped = df.drop(2, axis=0)

In [12]:
col_dropped

  Capital
0  Tehran
1  London
2   Paris

In [13]:
col_dropped

  Capital
0  Tehran
1  London
2   Paris

## Working with CSV files

In [ ]:
# --- Read from .csv
data = pd.read_csv("YOUR_FILENAME.csv")

# --- Write to .csv
data.to_csv("YOUR_FILENAME.csv")

## Selecting Method

In [ ]:
# --- انتخاب مجموعه‌ای از ردیف‌ها
df[2:3]    # انتخاب ردیف شماره ۳ یا ردیف با ایندکس شماره ۲
df[1:]   # انتخاب تمام ردیف‌ها از ردیف دوم تا انتها

# --- انتخاب یک ستون
df['Country']
df.Country

In [27]:
df.iloc[[0], [0]]         # انتخاب یک عضو با شماره‌ی ردیف و ستون آن

  Country
0    Iran

In [28]:
df.iloc[[0,2], [0,1]]     # انتخاب داده‌های ردیف اول و ششم در ستون‌های اول و دوم

  Country Capital
0    Iran  Tehran
2  France   Paris

In [31]:
df.loc[[0], ['Country']]                  # انتخاب یک عضو با نام ردیف و ستون آن

  Country
0    Iran

In [33]:
df.loc[[0,2], ['Country','Capital']]     # انتخاب داده‌های ردیف اول و ششم در ستون‌های اول و دوم

  Country Capital
0    Iran  Tehran
2  France   Paris

In [34]:
df[df['Capital'] == 'Tehran']

  Country Capital
0    Iran  Tehran

## Information

In [39]:
print(df.shape)  # ابعاد دیتافریم
print("\n")
print(df.index)  # مجموعه تمام ایندکس‌ها
print("\n")
print(df.columns)  # مجموعه اسم تمام ستون‌ها
print("\n")
print(df.info())  # یکسری اطلاعات ساده از دیتافریم مانند حجم، نوع داده‌ها و غیره
print("\n")
print(df.count())  # شمارش تعداد اعضای غیر خالی

print("\n")
print(df.sum())  # جمع تمام ستون‌ها
# print(df.min() , df.max())  #  محاسبه مقدار مینیمم و ماکزیمم
# print(df.idmin() , df.idmax())  # استخراج آدرس مقدار مینیمم و ماکزیمم
print("\n")
print(df.describe())  # اطلاعات آماری
# print(df.mean())  # مقدار میانگین
# print(df.median())  # مقدار میانه

(3, 2)


RangeIndex(start=0, stop=3, step=1)


Index(['Country', 'Capital'], dtype='object')


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  3 non-null      object
 1   Capital  3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes
None


Country    3
Capital    3
dtype: int64


Country    IranEnglandFrance
Capital    TehranLondonParis
dtype: object


       Country Capital
count        3       3
unique       3       3
top       Iran  Tehran
freq         1       1